In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
dic1={
    
    'name':['tom','jay','helly'],
    'age':[11,12,33],
    'classRoom':[1,2,3]
}

In [3]:
df1=DataFrame(data=dic1)
df2=DataFrame(data=np.random.randint(60,100,size=(3,3)),
              index=['jay','tom','helly'],
             columns=['java','python','c'])

In [4]:
df1

   age  classRoom   name
0   11          1    tom
1   12          2    jay
2   33          3  helly

In [5]:
df2

       java  python   c
jay      65      99  97
tom      82      60  80
helly    74      79  92

In [6]:
pd.merge(df1,df2,left_on='name',right_index=True)

   age  classRoom   name  java  python   c
0   11          1    tom    82      60  80
1   12          2    jay    65      99  97
2   33          3  helly    74      79  92

In [24]:
pd.merge(df2,df1,left_index=True,right_on='name')

   java  python   c  age  classRoom   name
1    96      80  95   12          2    jay
0    93      73  82   11          1    tom
2    93      70  83   33          3  helly